---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSettings.IsNetworkBasedCalculationsEnabled(Autodesk.Revit.DB.Document)
source: html/ec71c154-e6cc-496f-3e73-c51735b4a2bc.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.IsNetworkBasedCalculationsEnabled Method

Indicates whether network based calculations for duct networks is enabled in the specified document.

## Syntax (C#)
```csharp
public static bool IsNetworkBasedCalculationsEnabled(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
Returns true if network based calculations for duct networks is enabled, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null